#' Trim Russian language region codes
#'
#' Converts long country names into one of many different coding schemes.
#' Translates from one scheme to another. Converts country name or coding
#' scheme to the official short English country name. Creates a new variable
#' with the name of the continent or region to which each country belongs.
#'
#' @param x Vector to be trimmed
#' @keywords trim_region_names_rus
#' @note Supports the following coding schemes: Correlates of War character,
#' CoW-numeric, ISO3-character, ISO3-numeric, ISO2-character, IMF numeric, International
#' Olympic Committee, FIPS 10-4, FAO numeric, United Nations numeric,
#' World Bank character, official English short country names (ISO), continent, region.
#'
#' @aliases trim_region_names_rus


trim_region_names_rus <- function(x) {
  
  x <- x[x != "Агинский Бурятский авт.округ"]
  x <- x[x != "Агинский Бурятский автономный округ"]
  x <- x[x != "Алтайский край Бийская"]
  x <- x[x != "Алтайский край Барнаульская"]
  x <- x[x != "Алтайский край Рубцовская"]
  x <- x[x != "Более аграрные регионы "]
  x <- x[x != "Волго-Вятский район"]
  x <- x[x != "Волгоградская область Волгоградская"]
  x <- x[x != "Волгоградская область Волжская"]
  x <- x[x != "Волгоградская область Михайловская"]
  x <- x[x != "Воронежская область Воронежская"]
  x <- x[x != "Воронежская область Павловская"]
  x <- x[x != "Восточно-Сибирский район"]
  
  x <- x[x != "Город Москва Восточная"]
  x <- x[x != "Город Москва Донская"]
  x <- x[x != "Город Москва Кунцевская"]
  x <- x[x != "Город Москва Люблинская"]
  x <- x[x != "Город Москва Медведковская"]
  x <- x[x != "Город Москва Тушинская"]
  x <- x[x != "Город Москва Царицынская"]
  x <- x[x != "Город Москва Центральная"]
  x <- x[x != "Город Москва Черемушкинская"]
  x <- x[x != "Город Москва Шереметьевская"]
  
  x <- x[x != "Город Санкт Петербург Восточная"]
  x <- x[x != "Город Санкт Петербург Западная"]
  x <- x[x != "Город Санкт Петербург Северная"]
  x <- x[x != "Город Санкт Петербург Центральная"]
  x <- x[x != "Город Санкт Петербург Южная"]
  
  x <- x[x != "Город Байконур Республика Казахстан"]
  
  x <- x[x != "Дальневосточный район"]
  
  x <- x[x != "Западно-Сибирский район"]
  
  x <- x[x != "Иркутская область Братская"]
  x <- x[x != "Иркутская область Иркутская"]
  
  x <- x[x != "Коми-Пермяцкий авт.округ"]
  x <- x[x != "Коми-Пермяцкий автономный округ"]
  
  x <- x[x != "Корякский автономный  округ"]
  x <- x[x != "Корякский автономный округ"]
  
  x <- x[x != "Краснодарский край Армавирская"]
  x <- x[x != "Краснодарский край Каневская"]
  x <- x[x != "Краснодарский край Краснодарская"]
  x <- x[x != "Краснодарский край Крымская"]
  x <- x[x != "Краснодарский край Сочинская"]
  x <- x[x != "Краснодарский край Лабинская"]
  x <- x[x != "Краснодарский край Усть Лабинская"]
  
  x <- x[x != "Красноярский край Ачинско Минусинская"]
  x <- x[x != "Красноярский край Красноярская"]
  x <- x[x != "Красноярский край Норильско Канская"]
  
  x <- x[x != "Московская область в старых границах"]
  x <- x[x != "Московская область Дмитровская"]
  x <- x[x != "Московская область Истринская"]
  x <- x[x != "Московская область Коломенская"]
  x <- x[x != "Московская область Люберецкая"]
  x <- x[x != "Московская область Ногинская"]
  x <- x[x != "Московская область Подольская"]
  x <- x[x != "Московская область Серпуховская"]
  x <- x[x != "Московская область Химкинская"]
  
  x <- x[x != "Нижегородская область Арзамасская"]
  x <- x[x != "Нижегородская область Кстовская "]
  x <- x[x != "Нижегородская область Кстовская"]
  x <- x[x != "Нижегородская область Нижегородская"]
  x <- x[x != "Нижегородская область Семеновская"]
  
  x <- x[x != "Новосибирская область Заельцовская"]
  x <- x[x != "Новосибирская область Искитимская"]
  x <- x[x != "Новосибирская область Новосибирская"]
  
  x <- x[x != "Омская область Омская"]
  x <- x[x != "Омская область Центральная"]
  
  x <- x[x != "Оренбургская область Новотроицкая"]
  x <- x[x != "Оренбургская область Оренбургская"]
  
  x <- x[x != "Пермский край Северная"]
  x <- x[x != "Пермский край Центральная"]
  x <- x[x != "Пермский край Южная"]
  
  x <- x[x != "Поволжский район"]
  
  x <- x[x != "Приморский край Северная"]
  x <- x[x != "Приморский край Южная"]
  
  x <- x[x != "Республика Адыгея Адыгея"]
  
  x <- x[x != "Республика Башкортостан Бирская"]
  x <- x[x != "Республика Башкортостан Салаватская"]
  x <- x[x != "Республика Башкортостан Стерлитамакская"]
  x <- x[x != "Республика Башкортостан Уфимская"]
  
  x <- x[x != "Республика Дагестан Дербентская"]
  x <- x[x != "Республика Дагестан Махачкалинская"]
  
  x <- x[x != "Республика Татарстан Татарстан"]
  x <- x[x != "Республика Татарстан Татарстан Московская"]
  x <- x[x != "Республика Татарстан Татарстан Набережночелнинская"]
  x <- x[x != "Республика Татарстан Татарстан Нефтяная"]
  x <- x[x != "Республика Татарстан Татарстан Центральная"]
  
  x <- x[x != "Ростовская область Волгодонская"]
  x <- x[x != "Ростовская область Каменская"]
  x <- x[x != "Ростовская область Новочеркасская"]
  x <- x[x != "Ростовская область Ростовская"]
  
  x <- x[x != "Самарская область Волжская"]
  x <- x[x != "Самарская область Самарская"]
  x <- x[x != "Самарская область Тольяттинская"]
  
  x <- x[x != "Саратовская область Балаковская"]
  x <- x[x != "Саратовская область Балашовская"]
  x <- x[x != "Саратовская область Саратовская"]
  
  x <- x[x != "Свердловская область Нижнетагильская"]
  x <- x[x != "Свердловская область Каменск Уральская"]
  x <- x[x != "Свердловская область Первоуральская"]
  x <- x[x != "Свердловская область Серовская"]
  x <- x[x != "Свердловская область Центральная"]
  
  x <- x[x != "Северный район"]
  x <- x[x != "Северо-Западный район"]
  x <- x[x != "Северо-Кавказский район"]
  
  x <- x[x != "Ставропольский край Пятигорская"]
  x <- x[x != "Ставропольский край Ставропольская"]
  
  x <- x[x != "Сумма"]
  
  x <- x[x != "Таймырский (Долгано-Ненецкий) авт.округ"]
  x <- x[x != "Таймырский (Долгано-Ненецкий) автономный округ"]
  
  x <- x[x != "Территория за пределами РФ"]
  
  x <- x[x != "Тульская область Новомосковская"]
  x <- x[x != "Тульская область Тульская"]
  
  x <- x[x != "Уральский район"]
  
  
  x <- x[x != "Усть-Ордынский Бурятский авт.округ"]
  x <- x[x != "Усть Ордынский Бурятский автономный округ"]
  x <- x[x != "Усть-Ордынский Бурятский автономный округ"]
  
  x <- x[x != "Центрально-Черноземный район"]
  x <- x[x != "Центральный район"]
  
  x <- x[x != "Челябинская область Златоустовская"]
  x <- x[x != "Челябинская область Калининская"]
  x <- x[x != "Челябинская область Кыштымская"]
  x <- x[x != "Челябинская область Магнитогорская"]
  
  x <- x[x != "Чувашская Республика Чувашия"]
  
  x <- x[x != "Эвенкийский авт.окpуг"]
  x <- x[x != "Эвенкийский автономный окpуг"]
  
  x <- x[x != "Южный федеральный округ (по 2009 год)"]
  x <- x[x != "Южный федеральный  округ (с 2010 года)"]
  
  # rename
  x[x == "Архангельская область (без АО)"] <- "Архангельская область"
  x[x == "Архангельская область (частично)"] <- "Архангельская область"
  
  x[x == "в том числе Ненецкий автономный округ"] <- "в том числе Ненецкий автономный округ"
  x[x == "в том числе Ненецкий \r\nавтономный округ"] <- "в том числе Ненецкий автономный округ"
  x[x == "в том числе Ненецкий\r\nавтономный округ"] <- "в том числе Ненецкий автономный округ"
  
    x[x == "в том числе Ненецкий автономный округ"] <- "Ненецкий авт.округ"
  
  
  
  x[x == "г. Москва"] <- "г.Москва"
  x[x == "г.Москва"] <- "г.Москва"
  x[x == "Город Москва"] <- "г.Москва"
  
  x[x == "Город Санкт Петербург"] <- "г.Санкт-Петербург"
  x[x == "г. Санкт-Петербург"] <- "г.Санкт-Петербург"
  
  x[x == "Еврейская авт.область"] <- "Еврейская автономная область"
  x[x == "Еврейская автономная\r\nобласть"] <- "Еврейская автономная область"
  
  x[x == "Кабардино Балкарская Республика"] <- "Кабардино-Балкарская Республика"
  
  x[x == "Камчатская область"] <- "Камчатский край"
  
  x[x == "Карачаево Черкесская Республика"] <- "Карачаево-Черкесская Республика"
  
  library(stringr)
  str_replace_all(x, "(Нижегородская область.)", "Нижегородская")
  x[x == "Нижегородская"] <- "Нижегородская область"
  
  str_replace_all(x, "(Новосибирская область.)", "Новосибирская область")
  
  x[x == "Пермская область"] <- "Пермский край"
  
  x[x == "Республика\r\nБашкортостан"] <- "Республика Башкортостан"
  
  x[x == "Республика Ингушетия (1990 г. - включая Чеченскую Республику)"] <- "Республика Ингушетия"
  x[x == "Республика Ингушетия \r\n(1990 г. - включая Чеченскую Республику)"] <- "Республика Ингушетия"
  
  x[x == "Республика Саха Якутия"] <- "Республика Саха (Якутия)"
  x[x == "Республика Саха\r\n(Якутия)"] <- "Республика Саха (Якутия)"
  
  x[x == "Республика Северная \r\nОсетия -Алания"] <- "Республика Северная Осетия - Алания"
  x[x == "Республика Северная Осетия Алания"] <- "Республика Северная Осетия - Алания"
  
  x[x == "Республика Северная Осетия - Алания"] <- "Республика Северная Осетия-Алания"
  
  
  
  x[x == "Российская Федерация, из них:"] <- "Российская Федерация"
  
  x[x == "Тюменская область (без АО)"] <- "Тюменская область"
  x[x == "Тюменская область (частично)"] <- "Тюменская область"
  
  x[x == "Ханты Мансийский автономный округ Югра"] <- "Ханты-Мансийский автономный округ-Югра"
  x[x == "Ханты-Мансийский автономный округ - Югра"] <- "Ханты-Мансийский автономный округ-Югра"
  x[x == "Ханты-Мансийский автономный округ-Югра"] <- "Ханты-Мансийский автономный округ-Югра"
  x[x == "Ханты-Мансийский\r\nавтономный округ - Югра"] <- "Ханты-Мансийский автономный округ-Югра"
  x[x == "Ханты-Мансийский АО"] <- "Ханты-Мансийский автономный округ-Югра"
    
  x[x == "Ханты-Мансийский автономный округ-Югра"] <- "Ханты-Мансийский авт.округ-Югра"
  
  x[x == "Челябинская область"] <- "Челябинская область"
  
  
  x[x == "Чеченская респ."] <- "Чеченская Республика"
  x[x == "Чеченская Республика (1990 г. - включая Республику Ингушетия)"] <- "Чеченская Республика"
  x[x == "Чеченская Республика \r\n(1990 г. - включая Республику Ингушетия)"] <- "Чеченская Республика"
  
  x[x == "Чукотский АО"] <- "Чукотский автономный округ"
  x[x == "Чукотский автономный округ"] <- "Чукотский авт.округ"
  
  x[x == "Ямало Ненецкий автономный округ"] <- "Ямало-Ненецкий автономный округ"
  x[x == "Ямало-Ненецкий автономный округ"] <- "Ямало-Ненецкий автономный округ"
  x[x == "Ямало-Ненецкий\r\nавтономный округ"] <- "Ямало-Ненецкий автономный округ"
  x[x == "Ямало-Ненецкий АО"] <- "Ямало-Ненецкий автономный округ"
  
  x[x == "Ямало-Ненецкий автономный округ"] <- "Ямало-Ненецкий авт.округ"
  

  
  
   
  
  
  return(x)
}


