#' Trim Russian language region codes
#'
#' Converts long country names into one of many different coding schemes.
#' Translates from one scheme to another. Converts country name or coding
#' scheme to the official short English country name. Creates a new variable
#' with the name of the continent or region to which each country belongs.
#'
#' @param x Vector to be trimmed
#' @keywords trim_region_names_rus
#' @note Supports the following coding schemes: Correlates of War character,
#' CoW-numeric, ISO3-character, ISO3-numeric, ISO2-character, IMF numeric, International
#' Olympic Committee, FIPS 10-4, FAO numeric, United Nations numeric,
#' World Bank character, official English short country names (ISO), continent, region.
#'
#' @aliases trim_region_names_rus

trim_region_names_rus <- function(x) {
  
  # Most of these come from the RLMS data region variable
  x <- as.character(x)
  library(stringr)
  x <- str_trim(x)
#   x <- x[x != "Агинский Бурятский авт.округ"]
#   x <- x[x != "Агинский Бурятский автономный округ"]
#   x <- x[x != "Алтайский край Бийская"]
#   x <- x[x != "Алтайский край Барнаульская"]
#   x <- x[x != "Алтайский край Рубцовская"]
#   x <- x[x != "Более аграрные регионы "]
#   x <- x[x != "Волго-Вятский район"]
#   x <- x[x != "Волгоградская область Волгоградская"]
#   x <- x[x != "Волгоградская область Волжская"]
#   x <- x[x != "Волгоградская область Михайловская"]
#   x <- x[x != "Воронежская область Воронежская"]
#   x <- x[x != "Воронежская область Павловская"]
#   x <- x[x != "Восточно-Сибирский район"]
#   
#   x <- x[x != "Город Москва Восточная"]
#   x <- x[x != "Город Москва Донская"]
#   x <- x[x != "Город Москва Кунцевская"]
#   x <- x[x != "Город Москва Люблинская"]
#   x <- x[x != "Город Москва Медведковская"]
#   x <- x[x != "Город Москва Тушинская"]
#   x <- x[x != "Город Москва Царицынская"]
#   x <- x[x != "Город Москва Центральная"]
#   x <- x[x != "Город Москва Черемушкинская"]
#   x <- x[x != "Город Москва Шереметьевская"]
#   
#   x <- x[x != "Город Санкт Петербург Восточная"]
#   x <- x[x != "Город Санкт Петербург Западная"]
#   x <- x[x != "Город Санкт Петербург Северная"]
#   x <- x[x != "Город Санкт Петербург Центральная"]
#   x <- x[x != "Город Санкт Петербург Южная"]
#   
#   x <- x[x != "Город Байконур Республика Казахстан"]
#   
#   x <- x[x != "Дальневосточный район"]
#   
#   x <- x[x != "Западно-Сибирский район"]
#   
#   x <- x[x != "Иркутская область Братская"]
#   x <- x[x != "Иркутская область Иркутская"]
#   
#   x <- x[x != "Коми-Пермяцкий авт.округ"]
#   x <- x[x != "Коми-Пермяцкий автономный округ"]
#   
#   x <- x[x != "Корякский автономный  округ"]
#   x <- x[x != "Корякский автономный округ"]
#   
#   x <- x[x != "Краснодарский край Армавирская"]
#   x <- x[x != "Краснодарский край Каневская"]
#   x <- x[x != "Краснодарский край Краснодарская"]
#   x <- x[x != "Краснодарский край Крымская"]
#   x <- x[x != "Краснодарский край Сочинская"]
#   x <- x[x != "Краснодарский край Лабинская"]
#   x <- x[x != "Краснодарский край Усть Лабинская"]
#   
#   x <- x[x != "Красноярский край Ачинско Минусинская"]
#   x <- x[x != "Красноярский край Красноярская"]
#   x <- x[x != "Красноярский край Норильско Канская"]
#   
#   x <- x[x != "Московская область в старых границах"]
#   x <- x[x != "Московская область Дмитровская"]
#   x <- x[x != "Московская область Истринская"]
#   x <- x[x != "Московская область Коломенская"]
#   x <- x[x != "Московская область Люберецкая"]
#   x <- x[x != "Московская область Ногинская"]
#   x <- x[x != "Московская область Подольская"]
#   x <- x[x != "Московская область Серпуховская"]
#   x <- x[x != "Московская область Химкинская"]
#   
#   x <- x[x != "Нижегородская область Арзамасская"]
#   x <- x[x != "Нижегородская область Кстовская "]
#   x <- x[x != "Нижегородская область Кстовская"]
#   x <- x[x != "Нижегородская область Нижегородская"]
#   x <- x[x != "Нижегородская область Семеновская"]
#   
#   x <- x[x != "Новосибирская область Заельцовская"]
#   x <- x[x != "Новосибирская область Искитимская"]
#   x <- x[x != "Новосибирская область Новосибирская"]
#   
#   x <- x[x != "Омская область Омская"]
#   x <- x[x != "Омская область Центральная"]
#   
#   x <- x[x != "Оренбургская область Новотроицкая"]
#   x <- x[x != "Оренбургская область Оренбургская"]
#   
#   x <- x[x != "Пермский край Северная"]
#   x <- x[x != "Пермский край Центральная"]
#   x <- x[x != "Пермский край Южная"]
#   
#   x <- x[x != "Поволжский район"]
#   
#   x <- x[x != "Приморский край Северная"]
#   x <- x[x != "Приморский край Южная"]
#   
#   x <- x[x != "Республика Адыгея Адыгея"]
#   
#   x <- x[x != "Республика Башкортостан Бирская"]
#   x <- x[x != "Республика Башкортостан Салаватская"]
#   x <- x[x != "Республика Башкортостан Стерлитамакская"]
#   x <- x[x != "Республика Башкортостан Уфимская"]
#   
#   x <- x[x != "Республика Дагестан Дербентская"]
#   x <- x[x != "Республика Дагестан Махачкалинская"]
#   
#   x <- x[x != "Республика Татарстан Татарстан"]
#   x <- x[x != "Республика Татарстан Татарстан Московская"]
#   x <- x[x != "Республика Татарстан Татарстан Набережночелнинская"]
#   x <- x[x != "Республика Татарстан Татарстан Нефтяная"]
#   x <- x[x != "Республика Татарстан Татарстан Центральная"]
#   
#   x <- x[x != "Ростовская область Волгодонская"]
#   x <- x[x != "Ростовская область Каменская"]
#   x <- x[x != "Ростовская область Новочеркасская"]
#   x <- x[x != "Ростовская область Ростовская"]
#   
#   x <- x[x != "Самарская область Волжская"]
#   x <- x[x != "Самарская область Самарская"]
#   x <- x[x != "Самарская область Тольяттинская"]
#   
#   x <- x[x != "Саратовская область Балаковская"]
#   x <- x[x != "Саратовская область Балашовская"]
#   x <- x[x != "Саратовская область Саратовская"]
#   
#   x <- x[x != "Свердловская область Нижнетагильская"]
#   x <- x[x != "Свердловская область Каменск Уральская"]
#   x <- x[x != "Свердловская область Первоуральская"]
#   x <- x[x != "Свердловская область Серовская"]
#   x <- x[x != "Свердловская область Центральная"]
#   
#   x <- x[x != "Северный район"]
#   x <- x[x != "Северо-Западный район"]
#   x <- x[x != "Северо-Кавказский район"]
#   
#   x <- x[x != "Ставропольский край Пятигорская"]
#   x <- x[x != "Ставропольский край Ставропольская"]
#   
#   x <- x[x != "Сумма"]
#   
#   x <- x[x != "Таймырский (Долгано-Ненецкий) авт.округ"]
#   x <- x[x != "Таймырский (Долгано-Ненецкий) автономный округ"]
#   
#   x <- x[x != "Территория за пределами РФ"]
#   
#   x <- x[x != "Тульская область Новомосковская"]
#   x <- x[x != "Тульская область Тульская"]
#   
#   x <- x[x != "Уральский район"]
#   
#   
#   x <- x[x != "Усть-Ордынский Бурятский авт.округ"]
#   x <- x[x != "Усть Ордынский Бурятский автономный округ"]
#   x <- x[x != "Усть-Ордынский Бурятский автономный округ"]
#   
#   x <- x[x != "Центрально-Черноземный район"]
#   x <- x[x != "Центральный район"]
#   
#   x <- x[x != "Челябинская область Златоустовская"]
#   x <- x[x != "Челябинская область Калининская"]
#   x <- x[x != "Челябинская область Кыштымская"]
#   x <- x[x != "Челябинская область Магнитогорская"]
#   
#   x <- x[x != "Чувашская Республика Чувашия"]
#   
#   x <- x[x != "Эвенкийский авт.окpуг"]
#   x <- x[x != "Эвенкийский автономный окpуг"]
#   
#   x <- x[x != "Южный федеральный округ (по 2009 год)"]
#   x <- x[x != "Южный федеральный  округ (с 2010 года)"]
  
  # ------ Renaming the existing region names into a wiki Russian regions names

  # Архангельская область

  x[x == "Архангельская область (без АО)"]    <- "Архангельская область"
  x[x == "Архангельская область (частично)"]  <- "Архангельская область"

   # Адыгея
  
  x[x == "Республика Адыгея"]  <- "Адыгея"
  x[x == "Республика Адыгея Адыгея"] <- "Адыгея"

      
  # Алтайский край

  x[x == "Алтайский край Барнаульская"] <- "Алтайский край"
  x[x == "Алтайский край Бийская"] <- "Алтайский край"
  x[x == "Алтайский край Рубцовская"] <- "Алтайский край"
  
  # Амурская область
  
  # Архангельская область
  
  x[x == "Архангельская область (без АО)"] <- "Архангельская область"
  
  # Астраханская область
  
  # Башкортостан
  
  x[x == "Республика\r\nБашкортостан"]  <- "Башкортостан"
  x[x == "Республика Башкортостан"]     <- "Башкортостан"
  x[x == "Республика Башкортостан Бирская"] <- "Башкортостан"
  x[x == "Республика Башкортостан Салаватская"] <- "Башкортостан"
  x[x == "Республика Башкортостан Стерлитамакская"] <- "Башкортостан"
  x[x == "Республика Башкортостан Уфимская"] <- "Башкортостан"

  
  # Белгородская область
  
  # Брянская область
  
  # Бурятия
  
  x[x == "Республика Бурятия"]  <- "Бурятия"

  
  # Владимирская область
  
  # Волгоградская область

  x[x == "Волгоградская область Волгоградская"] <- "Волгоградская область"
  x[x == "Волгоградская область Волжская"] <- "Волгоградская область"
  x[x == "Волгоградская область Михайловская"] <- "Волгоградская область"
  
  # Вологодская область
  
  # Воронежская область

  x[x == "Воронежская область Воронежская"] <- "Воронежская область"
  x[x == "Воронежская область Павловская"] <- "Воронежская область"
  
  # Дагестан
  
  x[x == "Республика Дагестан"]  <- "Дагестан"
  x[x == "Республика Дагестан Дербентская"] <- "Дагестан"
  x[x == "Республика Дагестан Махачкалинская"] <- "Дагестан"
    
  # Еврейская автономная область

  x[x == "Еврейская авт.область"]           <- "Еврейская автономная область"
  x[x == "Еврейская автономная\r\nобласть"] <- "Еврейская автономная область"
  
  # Забайкальский край
  
  # Ивановская область
  
  # Ингушетия

  x[x == "Республика Ингушетия (1990 г. - включая Чеченскую Республику)"]     <- "Ингушетия"
  x[x == "Республика Ингушетия \r\n(1990 г. - включая Чеченскую Республику)"] <- "Ингушетия"
  x[x == "Республика Ингушетия"]                                              <- "Ингушетия"
  x[x == "Ингушетия"]  <- "Ингушетия"


  # Иркутская область

  x[x == "Иркутская область Братская"] <- "Иркутская область"
  x[x == "Иркутская область Иркутская"] <- "Иркутская область"
  
  # Кабардино-Балкария

  x[x == "Кабардино Балкарская Республика"] <- "Кабардино-Балкария"
  x[x == "Кабардино-Балкарская Республика"] <- "Кабардино-Балкария"
  
  # Калининградская область
  
  # Калмыкия
  
  x[x == "Республика Калмыкия"]  <- "Калмыкия"
  
  # Калужская область
  
  # Камчатский край

  x[x == "Камчатская область"] <- "Камчатский край"
  
  # Карачаево-Черкесия

  x[x == "Карачаево Черкесская Республика"] <- "Карачаево-Черкесия"
  x[x == "Карачаево-Черкесская Республика"] <- "Карачаево-Черкесия"

  # Кемеровская область
  
  # Кировская область
  
  # Костромская область
  
  # Краснодарский край

  x[x == "Краснодарский край Армавирская"] <- "Краснодарский край"
  x[x == "Краснодарский край Каневская"] <- "Краснодарский край"
  x[x == "Краснодарский край Краснодарская"] <- "Краснодарский край"
  x[x == "Краснодарский край Крымская"] <- "Краснодарский край"
  x[x == "Краснодарский край Сочинская"] <- "Краснодарский край"
  x[x == "Краснодарский край Усть Лабинская"] <- "Краснодарский край"

  
  # Красноярский край
  x[x == "Красноярский край Ачинско Минусинская"] <- "Красноярский край"
  x[x == "Красноярский край Красноярская"] <- "Красноярский край"
  x[x == "Красноярский край Норильско Канская"] <- "Красноярский край"
  
  # Курганская область
  
  # Курская область
  
  # Ленинградская область
  
  # Липецкая область
  
  # Магаданская область
  
  # Марий Эл
  
  x[x == "Республика Марий Эл"]  <- "Марий Эл"
    
  # Мордовия
  
  x[x == "Республика Мордовия"]  <- "Мордовия"
  
  # Москва

  x[x == "г. Москва"]     <- "Москва"
  x[x == "г.Москва"]      <- "Москва"
  x[x == "Город Москва"]  <- "Москва"
  x[x == "г.Москва в старых границах"] <- "Москва"
  x[x == "Город Москва Восточная"] <- "Москва"
  x[x == "Город Москва Донская"] <- "Москва"
  x[x == "Город Москва Кунцевская"] <- "Москва"
  x[x == "Город Москва Люблинская"] <- "Москва"
  x[x == "Город Москва Медведковская"] <- "Москва"
  x[x == "Город Москва Тушинская"] <- "Москва"
  x[x == "Город Москва Царицынская"] <- "Москва"
  x[x == "Город Москва Центральная"] <- "Москва"
  x[x == "Город Москва Черемушкинская"] <- "Москва"
  x[x == "Город Москва Шереметьевская"] <- "Москва"

  
  # Московская область

  x[x == "Московская область в старых границах"] <- "Московская область"
  x[x == "Московская область Дмитровская"] <- "Московская область"
  x[x == "Московская область Истринская"] <- "Московская область"
  x[x == "Московская область Коломенская"] <- "Московская область"
  x[x == "Московская область Люберецкая"] <- "Московская область"
  x[x == "Московская область Ногинская"] <- "Московская область"
  x[x == "Московская область Подольская"] <- "Московская область"
  x[x == "Московская область Серпуховская"] <- "Московская область"
  x[x == "Московская область Химкинская"] <- "Московская область"

  
  # Мурманская область
  
  # Ненецкий автономный округ

  x[x == "в том числе Ненецкий автономный округ"]       <- "Ненецкий автономный округ"
  x[x == "в том числе Ненецкий \r\nавтономный округ"]   <- "Ненецкий автономный округ"
  x[x == "в том числе Ненецкий\r\nавтономный округ"]    <- "Ненецкий автономный округ"
  x[x == "Ненецкий авт.округ"]    <- "Ненецкий автономный округ"
  x[x == "Ненецкий автономный\nокруг"] <- "Ненецкий автономный округ"

  
  
  # Нижегородская область

  x[x == "Нижегородская"]           <- "Нижегородская область"
  x[x == "Нижегородская область."]  <- "Нижегородская область"
  x[x == "Нижегородская область"]   <- "Нижегородская область"
  x[x == "Нижегородская область Арзамасская"] <- "Нижегородская область"
  x[x == "Нижегородская область Кстовская"] <- "Нижегородская область"
  x[x == "Нижегородская область Нижегородская"] <- "Нижегородская область"
  x[x == "Нижегородская область Семеновская"] <- "Нижегородская область"
  x[x == "Нижегородская область "] <- "Нижегородская область"
  x[x == "Нижегородская област  "] <- "Нижегородская область"
  x[x == "Новосибирская область "] <- "Нижегородская область"
  
# Новгородская область
  
  # Новосибирская область

  x[x == "Новосибирская область."] <- "Новосибирская область"
  x[x == "Новосибирская область Заельцовская"] <- "Новосибирская область"
  x[x == "Новосибирская область Искитимская"] <- "Новосибирская область"
  x[x == "Новосибирская область Новосибирская"] <- "Новосибирская область"
  x[x == "Новосибирская область "] <- "Новосибирская область"

  
  # Омская область

  x[x == "Омская область Омская"] <- "Омская область"
  x[x == "Омская область Центральная"] <- "Омская область"
  
  # Оренбургская область

  x[x == "Оренбургская область Новотроицкая"] <- "Оренбургская область"
  x[x == "Оренбургская область Оренбургская"] <- "Оренбургская область"
  
  # Орловская область
  
  # Пензенская область
  
  # Пермский край

  x[x == "Пермская область"] <- "Пермский край"
  x[x == "Пермский край Северная"] <- "Пермский край"
  x[x == "Пермский край Центральная"] <- "Пермский край"
  x[x == "Пермский край Южная"] <- "Пермский край"
  
  # Приморский край

  x[x == "Приморский край"] <- "Приморский край"
  x[x == "Приморский край"] <- "Приморский край"
  x[x == "Приморский край Северная"] <- "Приморский край"

  
  # Псковская область
  
  # Республика Алтай
  
  # Республика Карелия
  
  # Республика Коми

  x[x == "Коми-Пермяцкий авт.округ"] <- "Республика Коми"
  
  # Республика Крым
  
  # Ростовская область

  x[x == "Ростовская область Волгодонская"] <- "Ростовская область"
  x[x == "Ростовская область Каменская"] <- "Ростовская область"
  x[x == "Ростовская область Новочеркасская"] <- "Ростовская область"
  x[x == "Ростовская область Ростовская"] <- "Ростовская область"
  x[x == "Ростовская область Таганрогская"] <- "Ростовская область"

  
  # Рязанская область
  
  # Самарская область

  x[x == "Самарская область Волжская"] <- "Самарская область"
  x[x == "Самарская область Самарская"] <- "Самарская область"
  x[x == "Самарская область Тольяттинская"] <- "Самарская область"
  
  # Санкт-Петербург

  x[x == "Город Санкт Петербург"]   <- "Санкт-Петербург"
  x[x == "г. Санкт-Петербург"]      <- "Санкт-Петербург"
  x[x == "г.Санкт-Петербург"]       <- "Санкт-Петербург"
  x[x == "Город Санкт Петербург Восточная"] <- "Санкт-Петербург"
  x[x == "Город Санкт Петербург Западная"] <- "Санкт-Петербург"
  x[x == "Город Санкт Петербург Северная"] <- "Санкт-Петербург"
  x[x == "Город Санкт Петербург Центральная"] <- "Санкт-Петербург"
  x[x == "Город Санкт Петербург Южная"] <- "Санкт-Петербург"

  
  # Саратовская область

  x[x == "Саратовская область Балаковская"] <- "Саратовская область"
  x[x == "Саратовская область Балашовская"] <- "Саратовская область"
  x[x == "Саратовская область Саратовская"] <- "Саратовская область"
  
  # Сахалинская область
  
  # Свердловская область

  x[x == "Свердловская область Каменск Уральская"] <- "Свердловская область"
  x[x == "Свердловская область Нижнетагильская"] <- "Свердловская область"
  x[x == "Свердловская область Первоуральская"] <- "Свердловская область"
  x[x == "Свердловская область Серовская"] <- "Свердловская область"
  x[x == "Свердловская область Центральная"] <- "Свердловская область"
  x[x == "Свердловская область "] <- "Свердловская область"
  x[x == "Свердловская область "] <- "Свердловская область"

  
  # Севастополь
  
  # Северная Осетия

  x[x == "Республика Северная \r\nОсетия -Алания"]  <- "Северная Осетия"
  x[x == "Республика Северная Осетия Алания"]       <- "Северная Осетия"
  x[x == "Республика Северная Осетия - Алания"]     <- "Северная Осетия"
  x[x == "Республика Северная Осетия-Алания"]       <- "Северная Осетия"
  x[x == "Республика Северная Осетия – Алания"]   <- "Северная Осетия"
  x[x == "Республика Северная Осетия - Алания"]   <- "Северная Осетия"

  
  # Смоленская область
  
  # Ставропольский край

  x[x == "Ставропольский край Пятигорская"] <- "Ставропольский край"
  x[x == "Ставропольский край Ставропольская"] <- "Ставропольский край"
  
  # Тамбовская область
  
  # Татарстан
  
  x[x == "Республика Татарстан"]  <- "Татарстан"
  x[x == "Республика Татарстан Татарстан"] <- "Татарстан"
  x[x == "Республика Татарстан Татарстан Московская"] <- "Татарстан"
  x[x == "Республика Татарстан Татарстан Набережночелнинская"] <- "Татарстан"
  x[x == "Республика Татарстан Татарстан Нефтяная"] <- "Татарстан"
  x[x == "Республика Татарстан Татарстан Центральная"] <- "Татарстан"


  
  # Тверская область
  
  # Томская область
  
  # Тульская область

  x[x == "Тульская область Новомосковская"] <- "Тульская область"
  x[x == "Тульская область Тульская"] <- "Тульская область"
  
  # Тыва
  
  x[x == "Республика Тыва"]  <- "Тыва"
  
  # Тюменская область

  x[x == "Тюменская область (без АО)"]    <- "Тюменская область"
  x[x == "Тюменская область (частично)"]  <- "Тюменская область"
  
  # Удмуртия
  
  x[x == "Удмуртская Республика"]  <- "Удмуртия"
  
  
  # Ульяновская область
  
  # Хабаровский край

  x[x == "Хабаровский край "] <- "Хабаровский край"
  x[x == "Хабаровский край "] <- "Хабаровский край"
  
  # Хакасия
  
  x[x == "Республика Хакасия"]  <- "Хакасия"
    
  # Ханты-Мансийский автономный округ — Югра

  x[x == "Ханты Мансийский автономный округ Югра"]      <- "Ханты-Мансийский автономный округ — Югра"
  x[x == "Ханты-Мансийский автономный округ - Югра"]    <- "Ханты-Мансийский автономный округ — Югра"
  x[x == "Ханты-Мансийский автономный округ-Югра"]      <- "Ханты-Мансийский автономный округ — Югра"
  x[x == "Ханты-Мансийский\r\nавтономный округ - Югра"] <- "Ханты-Мансийский автономный округ — Югра"
  x[x == "Ханты-Мансийский АО"]                         <- "Ханты-Мансийский автономный округ — Югра"
  x[x == "Ханты-Мансийский авт.округ-Югра"]             <- "Ханты-Мансийский автономный округ — Югра"
  x[x == "Ханты-Мансийский автономный округ – Югра"] <- "Ханты-Мансийский автономный округ — Югра"

  
  # Челябинская область
  
  x[x == "Челябинская область"] <- "Челябинская область"
  x[x == "Челябинская область Златоустовская"] <- "Челябинская область"
  x[x == "Челябинская область Калининская"] <- "Челябинская область"
  x[x == "Челябинская область Кыштымская"] <- "Челябинская область"
  x[x == "Челябинская область Магнитогорская"] <- "Челябинская область"


  # Чечня

  x[x == "Чеченская респ."]                                                   <- "Чечня"
  x[x == "Чеченская Республика (1990 г. - включая Республику Ингушетия)"]     <- "Чечня"
  x[x == "Чеченская Республика \r\n(1990 г. - включая Республику Ингушетия)"] <- "Чеченская Республика"
  x[x == "Чеченская Республика"]                                              <- "Чечня"
  
  # Чувашия
  x[x == "Чувашская Республика"] <- "Чувашия"
  x[x == "Чувашская Республика Чувашия"] <- "Чувашия"

    
  # Чукотский автономный округ

    x[x == "Чукотский АО"]                <- "Чукотский автономный округ"
    x[x == "Чукотский автономный округ"]  <- "Чукотский автономный округ"
    x[x == "Чукотский авт.округ"]         <- "Чукотский автономный округ"
  
  
  # Якутия

  x[x == "Республика Саха Якутия"]      <- "Якутия"
  x[x == "Республика Саха\r\n(Якутия)"] <- "Якутия"
  x[x == "Республика Саха (Якутия)"]    <- "Якутия"
  x[x == "Якутия"]    <- "Якутия"
  
  # Ямало-Ненецкий автономный округ

  x[x == "Ямало Ненецкий автономный округ"]     <- "Ямало-Ненецкий автономный округ"
  x[x == "Ямало-Ненецкий автономный округ"]     <- "Ямало-Ненецкий автономный округ"
  x[x == "Ямало-Ненецкий\r\nавтономный округ"]  <- "Ямало-Ненецкий автономный округ"
  x[x == "Ямало-Ненецкий АО"]                   <- "Ямало-Ненецкий автономный округ"
  x[x == "Ямало-Ненецкий авт.округ"]            <- "Ямало-Ненецкий автономный округ"
  x[x == "Ненецкий авт.округ"]            <- "Ямало-Ненецкий автономный округ"
  x[x == "Ямало-Ненецкий \nавтономный округ"] <- "Ямало-Ненецкий автономный округ"

  
  
  
  # Ярославская область
  

# Центральный федеральный округ

x[x == "Центральный Федеральный округ"] <- "Центральный федеральный округ"
x[x == "Центральный\nфедеральный округ"] <- "Центральный федеральный округ"


# Южный федеральный округ

x[x == "Южный федеральный  округ (с 2010 года)"] <- "Южный федеральный округ"
x[x == "Южный федеральный округ (по 2009 год)"] <- "Южный федеральный округ" 
x[x == "Южный Федеральный округ (по 2009 год)"] <- "Южный федеральный округ" 
x[x == "Южный Федеральный округ (с 2010 года)"] <- "Южный федеральный округ" 
x[x == "Южный\nфедеральный округ"] <- "Южный федеральный округ"


#  Северо-Западный федеральный округ

x[x == "Северо-Западный Федеральный округ"] <- "Северо-Западный федеральный округ" 
x[x == "Северо-Западный\nфедеральный округ"] <- "Северо-Западный федеральный округ"



#  Дальневосточный федеральный округ

x[x == "Дальневосточный Федеральный округ"] <- "Дальневосточный федеральный округ"
x[x == "Дальневосточный\nфедеральный округ"] <- "Дальневосточный федеральный округ"

#  Сибирский федеральный округ               

x[x == "Сибирский Федеральный округ"] <- "Сибирский федеральный округ"
x[x == "Сибирский\nфедеральный округ"] <- "Сибирский федеральный округ"


#  Уральский федеральный округ

x[x == "Уральский Федеральный округ"] <- "Уральский федеральный округ"
x[x == "Уральский\nфедеральный округ"] <- "Уральский федеральный округ"


#  Приволжский федеральный округ

x[x == "Приволжский Федеральный округ"] <- "Приволжский федеральный округ"
x[x == "Приволжский\nфедеральный округ"] <- "Приволжский федеральный округ"


#  "Северо-Кавказский федеральный округ"       

x[x == "Северо-Кавказский федеральный округ"] <- "Северо-Кавказский федеральный округ" 
x[x == "Северо-Кавказский Федеральный округ"] <- "Северо-Кавказский федеральный округ" 



#  "Крымский федеральный округ"                



#  "Центральный экономический район"       

x[x == "Центральный район"] <- "Центральный экономический район"


#  "Центрально-Чернозёмный экономический район"

x[x == "Центрально-Черноземный район"] <- "Центрально-Чернозёмный экономический район"


#  "Восточно-Сибирский экономический район"
x[x == "Восточно-Сибирский район"] <- "Восточно-Сибирский экономический район"
#  "Дальневосточный экономический район"       
x[x == "Дальневосточный район"] <- "Дальневосточный экономический район"

#  "Северный экономический район"              

x[x == "Северный район"] <- "Северный экономический район"


#  "Северо-Кавказский экономический район"     
x[x == "Северо-Кавказский район"] <- "Северо-Кавказский экономический район"


#  "Северо-Западный экономический район"       

x[x == "Северо-Западный район"] <- "Северо-Западный экономический район"


#  "Поволжский экономический район"            

x[x == "Поволжский район"] <- "Поволжский экономический район"


#  "Уральский экономический район"             

x[x == "Уральский район"] <- "Уральский экономический район"


#  "Волго-Вятский экономический район"         

x[x == "Волго-Вятский район"] <- "Волго-Вятский экономический район"


#  "Западно-Сибирский экономический район"  

x[x == "Западно-Сибирский район"] <- "Западно-Сибирский экономический район"



# "Калининградский экономический район"   
#  "Россия"                                      

x[x == "Российская Федерация, из них:"] <- "Россия"
x[x == "Российская Федерация"]          <- "Россия"
x[x == "Российская Федеpация"]          <- "Россия"
x[x == "Территория за пределами РФ"] <- "Россия"



# Агинский Бурятский автономный округ 

x[x == "Агинский Бурятский авт.округ"] <- "Агинский Бурятский автономный округ"


# Коми-Пермяцкий автономный округ 

x[x == "Коми-Пермяцкий авт.округ"] <- "Коми-Пермяцкий автономный округ"


# Корякский округ 

x[x == "Корякский автономный  округ"] <- "Корякский округ"
x[x == "Корякский автономный  округ"] <- "Корякский округ"
x[x == "Корякский автономный округ"] <- "Корякский округ"
x[x == "Корякский авт.округ"] <- "Корякский округ"


# Таймырский (Долгано-Ненецкий) автономный округ  

x[x == "Таймырский (Долгано-Ненецкий) авт.округ"] <- "Таймырский (Долгано-Ненецкий) автономный округ"


# Усть-Ордынский Бурятский автономный округ 

x[x == "Усть-Ордынский Бурятский авт.округ"] <- "Усть-Ордынский Бурятский автономный округ"
x[x == "Усть Ордынский Бурятский автономный округ"] <- "Усть-Ордынский Бурятский автономный округ"

   
# Эвенкийский автономный округ

x[x == "Эвенкийский авт.окpуг"] <- "Эвенкийский автономный округ"
x[x == "Эвенкийский автономный окpуг"] <- "Эвенкийский автономный округ"

# Random old regions

# Читинская область

x[x == "Читинская область"] <- "Читинская область"

# Чечено-Ингушская Автономная Советская Социалистическая Республика

x[x == "Чеченская и Ингушская республики"] <- "Чечено-Ингушская Автономная Советская Социалистическая Республика"

# Байконур (город)

x[x == "Город Байконур Республика Казахстан"] <- "Байконур (город)"
    
    x <- str_trim(x)
  return(x)
}




